src/main/resources/suwinet/data/ExampleRequests/BRPDossierPersoonGSD_AanvraagPersoon_999991425.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v02="http://bkwi.nl/SuwiML/Diensten/BRPDossierPersoonGSD/v0200">
    <soapenv:Header/>
    <soapenv:Body>
        <v02:AanvraagPersoon>
            <Burgerservicenr>999991425</Burgerservicenr>
        </v02:AanvraagPersoon>
    </soapenv:Body>
</soapenv:Envelope>