src/main/resources/suwinet/data/Responses/BRPDossierPersoonGSD_AanvraagPersoon_241001420-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns3:AanvraagPersoon xmlns:ns2="http://bkwi.nl/SuwiML/FWI/v0205" xmlns:ns3="http://bkwi.nl/SuwiML/Diensten/BRPDossierPersoonGSD/v0200">
            <Burgerservicenr>241001420</Burgerservicenr>
        </ns3:AanvraagPersoon>
    </soap:Body>
</soap:Envelope>